## ASSIGNMENT 5

# Q1

In [80]:
import pandas as pd
import numpy as np
df1_train=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\Titanic_train.csv')
result=list()

#len(df_train[(df_train['Pclass']>2) & (df_train['Survived'] >0)])
#or
l=len(df1_train.loc[(df1_train['Pclass']>2) & (df1_train['Survived'] >0),:])
result.append(l)
m=len(df1_train[(df1_train['Sex']=='male') & (df1_train['Survived']<1)])
result.append(m)
n=len(df1_train[(df1_train['Embarked']=='S') & (df1_train['Survived']>0)])
result.append(n)
# Creating a list of the answer
print(result)
# NOTE: Here, 100, 200 and 300 are the answer of 1st, 2nd and 3rd question respectively. Change it accordingly.

# Finally create a dataframe of the final output  and write the output to output.csv

result=pd.DataFrame(result)
# writing output to output.csv
result.to_csv('output.csv', header=False, index=False)

[99, 423, 186]

# Q2

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
result=list()
#reading from the file Titanic_train.csv
df_train=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\Titanic_train.csv')
#df_test=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\Titanic_test.csv')
#view the dataset
q1_ans=len(df_train.loc[pd.isnull(df_train['Age']),:])
result.append(q1_ans)

df=df_train.loc[pd.isnull(df_train).any(1),:]
q2_ans=df.index.values.sum()
result.append(q2_ans)

from sklearn.preprocessing import LabelEncoder
s=LabelEncoder()
df_train['Sex']=s.fit_transform(df_train['Sex'])
char_cabin =df_train['Cabin'].astype(str)
newcabin=np.array([cabin[0] for cabin in char_cabin])
df_train['Cabin']= pd.Categorical(newcabin)
df_train['Cabin'] =s.fit_transform(df_train['Cabin'])
df_train['Embarked'] =df_train['Embarked'].astype(str)
df_train['Embarked'] =s.fit_transform(df_train['Embarked'])
#df_train['Pclass']=s.fit_transform(df_train['Pclass'])
newage_var =np.where(df_train['Age'].isnull(),28,df_train['Age'])
df_train['Age']=newage_var

x_train=df_train[['PassengerId', 'Survived', 'Pclass', 'Sex','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]
y_train=df_train['Age']


from sklearn.linear_model import LinearRegression
model=LinearRegression()
model=model.fit(x_train,y_train)
print(model.coef_)
print(model.intercept_)
prediction=model.predict(x_train)
#prediction[:10]
from sklearn.metrics import mean_squared_error, r2_score
print("Mean squared error: %.2f" % mean_squared_error(y_train, prediction))
print('Variance score: %.2f' % r2_score(y_train, prediction))
print('score of xtrain and ytrain:%.2f'% model.score(x_train,y_train))
predicted_age=pd.DataFrame(prediction)
q3_ans=np.mean(predicted_age)[0]
result.append(q3_ans)
# Finally create a dataframe of the final output  and write the output to output.csv
result=pd.DataFrame(result)
# writing output to output.csv
result.to_csv('output.csv', header=False, index=False)

[-6.58257956e-04 -5.79441916e+00 -5.81363134e+00 -1.01855782e+00
 -2.44138441e+00 -1.03219507e+00 -7.17140676e-03 -1.63881143e-01
  7.62369509e-01]
47.59340921237364
Mean squared error: 133.92
Variance score: 0.20
score of xtrain and ytrain:0.20

In [ ]:
from sklearn.preprocessing import LabelEncoder
s=LabelEncoder()
df_test['Sex']=s.fit_transform(df_test['Sex'])
chars_cabin =df_test['Cabin'].astype(str)
newscabin=np.array([cabin[0] for cabin in chars_cabin])
df_test['Cabin']= pd.Categorical(newscabin)
df_test['Cabin'] =s.fit_transform(df_test['Cabin'])
df_test['Embarked'] =df_test['Embarked'].astype(str)
df_test['Embarked'] =s.fit_transform(df_test['Embarked'])
#df_train['Pclass']=s.fit_transform(df_train['Pclass'])
new_age_var =np.where(df_test['Age'].isnull(),28,df_test['Age'])
df_test['Age']=new_age_var

In [205]:
df_train.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,463,0,1,"Gee, Mr. Arthur H",1,47.0,0,0,111320,38.5000,4,2
1,1,121,0,2,"Hickman, Mr. Stanley George",1,21.0,2,0,S.O.C. 14879,73.5000,8,2
2,3,415,1,3,"Sundman, Mr. Johan Julian",1,44.0,0,0,STON/O 2. 3101269,7.9250,8,2
3,4,480,1,3,"Hirvonen, Miss. Hildur E",0,2.0,0,1,3101298,12.2875,8,2
4,5,622,1,1,"Kimball, Mr. Edwin Nelson Jr",1,42.0,1,0,11753,52.5542,3,2

In [206]:
df_test.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,736,0,3,"Williams, Mr. Leslie",1,28.5,0,0,54636,16.1000,7,2
1,1,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",1,80.0,0,0,27042,30.0000,0,2
2,2,636,1,2,"Davis, Miss. Mary",0,28.0,0,0,237668,13.0000,7,2
3,3,624,0,3,"Hansen, Mr. Henry Damsgaard",1,21.0,0,0,350029,7.8542,7,2
4,4,787,1,3,"Sjoblom, Miss. Anna Sofia",0,18.0,0,0,3101265,7.4958,7,2

In [207]:
df_train.isnull().any()

Unnamed: 0     False
PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

In [189]:
set(df_train['Cabin'])

{0, 1, 2, 3, 4, 5, 6, 7, 8}

In [190]:
df_train['Ticket'].dtype

dtype('O')

In [191]:
set(df1_train['Pclass'])

{1, 2, 3}

In [192]:
df_train.columns

Index(['Unnamed: 0', 'PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
pottii=pd.DataFrame(df_train['Sex'].map(dict(male=0,female=1)))
df_train['Sex']=pottii
#pottii

In [53]:
set(df_train['Embarked'])

{'C', 'Q', 'S', nan}

In [54]:
oyy=pd.DataFrame(df_train['Embarked'].map(dict(C=0,Q=1,S=2,NaN=3)))
df_train['Embarked']=oyy

In [10]:
np.where(df_train['Embarked'].isnull())

(array([], dtype=int64),)

In [11]:
df_train['Embarked'].unique()

array([2, 0, 1, 3], dtype=int64)

In [193]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model=model.fit(x_train,y_train)

print(model.coef_)
print(model.intercept_)

[-6.58257956e-04 -5.79441916e+00 -5.81363134e+00 -1.01855782e+00
 -2.44138441e+00 -1.03219507e+00 -7.17140676e-03 -1.63881143e-01
  7.62369509e-01]
47.59340921237364

In [199]:
prediction=model.predict(df_test[['PassengerId', 'Survived', 'Pclass', 'Sex','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']])
#prediction[:10]
from sklearn.metrics import mean_squared_error, r2_score
print("Mean squared error: %.2f" % mean_squared_error(df_test['Age'], prediction))
print('Variance score: %.2f' % r2_score(df_test['Age'], prediction))

print('score of xtrain and y train:%.2f'% model.score(x_train,y_train))

Mean squared error: 145.47
Variance score: 0.20
score of xtrain and y train:0.20

In [195]:
#

In [161]:
#

In [162]:
#

In [196]:
df_train.shape

(781, 13)

In [197]:
predicted_age=pd.DataFrame(prediction)
np.mean(predicted_age)[0]

28.405427152484535

In [198]:
np.mean(predicted_age)[0]

28.405427152484535

In [2]:
import numpy as np
import pandas as pd
train=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\training-Titanic_train\Titanic_train.csv')
valid=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\validation-Titanic_test\Titanic_test.csv')
test=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\evaluation-Titanic_test\Titanic_test.csv')

In [6]:
print(train.shape)
train.head()

(781, 13)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,463,0,1,"Gee, Mr. Arthur H",male,47.0,0,0,111320,38.5000,E63,S
1,1,121,0,2,"Hickman, Mr. Stanley George",male,21.0,2,0,S.O.C. 14879,73.5000,NaN,S
2,3,415,1,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S
3,4,480,1,3,"Hirvonen, Miss. Hildur E",female,2.0,0,1,3101298,12.2875,NaN,S
4,5,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.0,1,0,11753,52.5542,D19,S

In [7]:
print(valid.shape)
valid.head()

(110, 13)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,736,0,3,"Williams, Mr. Leslie",male,28.5,0,0,54636,16.1000,NaN,S
1,1,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
2,2,636,1,2,"Davis, Miss. Mary",female,28.0,0,0,237668,13.0000,NaN,S
3,3,624,0,3,"Hansen, Mr. Henry Damsgaard",male,21.0,0,0,350029,7.8542,NaN,S
4,4,787,1,3,"Sjoblom, Miss. Anna Sofia",female,18.0,0,0,3101265,7.4958,NaN,S

In [8]:
print(test.shape)
test.head()

(110, 13)

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,736,0,3,"Williams, Mr. Leslie",male,28.5,0,0,54636,16.1000,NaN,S
1,1,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
2,2,636,1,2,"Davis, Miss. Mary",female,28.0,0,0,237668,13.0000,NaN,S
3,3,624,0,3,"Hansen, Mr. Henry Damsgaard",male,21.0,0,0,350029,7.8542,NaN,S
4,4,787,1,3,"Sjoblom, Miss. Anna Sofia",female,18.0,0,0,3101265,7.4958,NaN,S

In [16]:
len(train['Age'])

781

In [45]:
new=[]
for i in train['Age']:
    if i>18:
        new.append('A')
    else:
        new.append('C')

train['status']=new

In [46]:
train.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,status
0,0,463,0,1,"Gee, Mr. Arthur H",male,47.0,0,0,111320,38.5000,E63,S,A
1,1,121,0,2,"Hickman, Mr. Stanley George",male,21.0,2,0,S.O.C. 14879,73.5000,NaN,S,A
2,3,415,1,3,"Sundman, Mr. Johan Julian",male,44.0,0,0,STON/O 2. 3101269,7.9250,NaN,S,A
3,4,480,1,3,"Hirvonen, Miss. Hildur E",female,2.0,0,1,3101298,12.2875,NaN,S,C
4,5,622,1,1,"Kimball, Mr. Edwin Nelson Jr",male,42.0,1,0,11753,52.5542,D19,S,A

In [47]:
train.shape

(781, 14)

In [48]:
adult_survivors=len(train[(train['Survived']>0) & (train['status']=='A')])
child_survivors=len(train[(train['Survived']>0) & (train['status']=='C')])
total=adult_survivors+child_survivors

In [49]:
total

290

# Q3

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#reading from the file Titanic_train.csv
train=pd.read_csv(r'C:\Users\hp\Desktop\edureka\assignments\Titanic_dataset\training-Titanic_train\Titanic_train.csv')

result=list()
new=[]
for i in train['Age']:
    if i>18:
        new.append('A')
    else:
        new.append('C')

train['status']=new
adult_survivors=len(train[(train['Survived']>0) & (train['status']=='A')])
child_survivors=len(train[(train['Survived']>0) & (train['status']=='C')])
total=adult_survivors+child_survivors
result.append(total)

from sklearn.preprocessing import LabelEncoder
s=LabelEncoder()
train['Sex']=s.fit_transform(train['Sex'])
char_cabin =train['Cabin'].astype(str)
newcabin=np.array([cabin[0] for cabin in char_cabin])
train['Cabin']= pd.Categorical(newcabin)
train['Cabin'] =s.fit_transform(train['Cabin'])
train['Embarked'] =train['Embarked'].astype(str)
train['Embarked'] =s.fit_transform(train['Embarked'])
#train['Pclass']=s.fit_transform(train['Pclass'])
newage_var =np.where(train['Age'].isnull(),28,train['Age'])
train['Age']=newage_var

x_train=train[['PassengerId', 'Age', 'Pclass', 'Sex','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']]
y_train=train['Survived']

from sklearn.linear_model import LogisticRegression
model=LogisticRegression()
model=model.fit(x_train,y_train)
print(model.coef_)
print(model.intercept_)
prediction=model.predict(train[['PassengerId', 'Age', 'Pclass', 'Sex','SibSp', 'Parch', 'Fare', 'Cabin', 'Embarked']])
print(prediction[:10])
from sklearn.metrics import mean_squared_error, r2_score
print("Mean squared error: %.2f" % mean_squared_error(train['Survived'], prediction))
#print('Variance score: %.2f' % r2_score(train['Survived'], prediction))
#pd.crosstab(pd.DataFrame(prediction),train['Age'])
from sklearn.metrics import confusion_matrix,classification_report
t=confusion_matrix(pd.DataFrame(prediction),train['Survived']).sum()
result.append(t)
print('score of xtrain and ytrain:%.2f'% model.score(x_train,y_train))
s=model.score(x_train,y_train)*100
result.append(np.round(s,2))
#print(classification_report(prediction,train['Survived']))
# Finally create a dataframe of the final output  and write the output to output.csv
result=pd.DataFrame(result)
# writing output to output.csv
result.to_csv('output.csv', header=False, index=False)

C:\Users\hp\Anaconda3\lib\site-packages\sklearn\linear_model\logistic.py:433: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

[[ 2.34824556e-04 -3.07713849e-02 -6.85412520e-01 -2.46489693e+00
  -3.37114170e-01 -4.44249221e-02  5.42214888e-03 -5.57548901e-02
  -3.84920536e-02]]
[3.76658358]
[0 0 0 1 0 0 1 0 0 0]
Mean squared error: 0.20
score of xtrain and ytrain:0.80

In [59]:
pd.crosstab(prediction,train['Survived'])

Survived    0    1
row_0
0         429   93
1          62  197

[[429  93]
 [ 62 197]]
              precision    recall  f1-score   support

           0       0.87      0.82      0.85       522
           1       0.68      0.76      0.72       259

   micro avg       0.80      0.80      0.80       781
   macro avg       0.78      0.79      0.78       781
weighted avg       0.81      0.80      0.80       781

In [67]:
t=confusion_matrix(pd.DataFrame(prediction),train['Survived']).sum()

In [68]:
t

781